# Алексей Родионов - "Metropolis"
# Пользовательские сценарии

### Группа: 10 - МИ - 3
### Электронная почта: strose2002@gmail.com
### VK: https://vk.com/atmosferniyparen


### [ Сценарий 1 - Построение маршрутов ]

1. Пользователь запускает основное окно.  
2. На экране появляется карта метро, окно для отображения подробностей поездки (окно маршрута), лента с вспомогательными кнопками (Настройки, Помощь, Язык и др.).
3. Пользователь выбирает начальную станцию, ее название записывается в окно "Начальная станция".
4. Пользователь выбирает конечную станцию,  ее название записывается в окно "Конечная станция".
5. На экране, в окне маршрута, отображаются подробности поездки (вагоны для посадки, время в пути, станции на пути), на самой карте выделяется маршрут.
6. Пользователь масштабирует карту, "перемещается" по ней.
7. У пользователя есть возможность очистить окна начальной и конечной станции, вписать название с клавиатуры в соответствующее окно. Маршрут построится заново.
8. При выборе станции открывается контекстное меню. При нажатии на кнопку "Показать информацию" запускается сценарий №2.

### [ Сценарий 2 - Информация о станциях ]

1. На экран выводится форма, содержащая основную информацию, находящуюся в соответствующих разделах.
2. У пользователя есть возможность выбрать интересующий раздел.
3. При выборе раздела "Информация", на экран выводятся основные данные о станции (Инфраструктура, Описание, Интересные факты и т. п.).
4. При выборе раздела "История", на экран выводится краткая историческая справка о станции (Год основания, Архитекторы, Примечательные собыитя и т.п.).
5. При выборе раздела "Маршрут", на экран выводится актуальная для маршрутов информация (Выходы и входы, Время переходов, Платформы и т. п.).
6. При выборе раздела "Фотографии", на экран выводятся изображения станции.
7. При нажатии на кнопку "Закрыть", запускается основное окно, а данное закрывается.

### [ Сценарий 3 - История]

1. Пользователь нажимает на одну из станций метро на карте, появляется контекстное меню.
2. Пользователь нажимает на кнопку "Историческая справка".
3. На экране появляется окно, в котором содержится подробная история станции, взятая из открытых источников, важные даты и события, исторические факты, фотографии в разное время.
4. Пользователь закрывает окно и нажимает на кнопку "Историческое представление"
5. Пользователь определяет, в какое время хочет увидеть Московское метро и выбирает соответствующий  год.
6. Схема метро меняется, вместо нее выводится изображение, соответствующее указанной дате.
7. Пользователь таким же образом масштабирует данную схему, как и в сценарии №1, но без возможности строить маршрут.
8. При нажатии на кнопку "К текущему году", изображения заменяются актуальной схемой, которая вновь становится активной, переходя к начальному состоянию.

### [ Сценарий 4 - Викторина ]

1. Пользователь нажимает на кнопку "Обучение" и выбирает раздел "Викторина".
2. На экране появляется окно, в котором содержатся элементы для: 
отображения вопроса, вариантов ответа, статистики пользователя, пояснений к ответу.
3. Пользователь нажимает кнопку "Начать игру". 
4. На экране отображается вопрос о московском метро и варианты ответов к нему.
5. Пользователь выбирает один из них. В зависимости от того, правильно ли ответил пользователь, меняется статистика.
6. К некоторым вопросам после ответа дается небольшое пояснение.
7. Пользователь нажимает на кнопку "Следующий вопрос", переходя к шагу 4.
8. При нажатии на кнопку "Закрыть", запускается основное окно, а данное закрывается.

### [ Сценарий 5 - Обновление ]

1. Пользователь загружает пакет обновлений из стороннего источника.
2. Пользователь перемещает закгруженный пакет в соответствующую директорию программы.
3. Пользователь запускает программу.
4. Пользователь нажимает на кнопку "Настройки", выбирает раздел "Обновления".
5. Пользователь нажимает необходимые кнопки для установки обновления.
6. Программа обновляется, перезапускается.

### [ Сценарий 6 - Настройки и помощь]

1. При нажатии на кнопку "Помощь" пользователю выводится диалоговое окно со справкой, описывающей работу программы.
2. При закрытии справки, пользователь возвращается к основному окну.
3. Пользователь нажимает на кнопку "Настройки", выбирает раздел "Язык".
4. В предложенном списке он выбирает интересующий его язык.
5. Интерфейс программы меняется в соответствии с выбором пользователя.
6. Внутри программы меняются файлы, из которых нужно брать данные. 
7. При желании, пользователь меняет язык обратно, переходя к шагу 3.
8. Также у пользователя есть возможность изменить другие настройки для персонализации интерфейса.
9. При нажатии на кнопку "Режим разработчика", запускается режим 7.

### [ Сценарий 7 - Режим разработчика]

1. На экране появляется окно авторизации.
2. Пользователь вводит логин и пароль, для того чтобы авторизоваться и получить доступ к данному режиму.
3. Система проверяет введенный логин и пароль.
3. В случае, если такого логина и/или пароля для разработчика не существует, система уведомляет об этом пользователя
4. В случае, если пользователь успешно авторизовался в системе, ему становится доступен данный режим
5. Пользователь может по своему усмотрению редактировать карту метро.
6. При добавлении станции, разработчик заполняет необходимую информацию о станции, эти данные записываются и сохраняются в программе.
7. При удалении станции, данные о ней удаляются из программы.
8. При закрытии данного режима, запускается основное окно.
